conquering-your-finance-with-emacs-thoughtbot.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-08-08 Thu 00:10 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>conquering-your-finance-with-emacs-thoughtbot</title>
<meta name="author" content="Levin" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">conquering-your-finance-with-emacs-thoughtbot</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org093f508">1. link to the video</a></li>
<li><a href="#org8c963bf">2. ledger is double entry accounting tool.</a></li>
<li><a href="#org05c7cc8">3. is a CLI tool</a></li>
<li><a href="#org856b3da">4. Double entry?</a>
<ul>
<li><a href="#org74fb0fb">4.1. Try this</a></li>
<li><a href="#org326f763">4.2. The five accounts</a></li>
</ul>
</li>
<li><a href="#org0b7a5cc">5. Accounting equations</a>
<ul>
<li><a href="#orgf67f85b">5.1. Net worth = Assets - liabilities</a></li>
<li><a href="#org341eb3b">5.2. Net income = Income - Expenses</a></li>
</ul>
</li>
<li><a href="#orgce9d41b">6. so whats the point?</a>
<ul>
<li><a href="#orgd8acb5b">6.1. its your data</a></li>
<li><a href="#orgf516a47">6.2. expressive reporting capacbility</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org093f508" class="outline-2">
<h2 id="org093f508"><span class="section-number-2">1.</span> <a href="https://www.youtube.com/watch?v=cjoCNRpLanY&amp;pp=ygUXdGhvdWdodGJvdCBlbWFjcyBsZWRnZXI%3D">link to the video</a></h2>
</div>
<div id="outline-container-org8c963bf" class="outline-2">
<h2 id="org8c963bf"><span class="section-number-2">2.</span> ledger is double entry accounting tool.</h2>
</div>
<div id="outline-container-org05c7cc8" class="outline-2">
<h2 id="org05c7cc8"><span class="section-number-2">3.</span> is a CLI tool</h2>
</div>
<div id="outline-container-org856b3da" class="outline-2">
<h2 id="org856b3da"><span class="section-number-2">4.</span> Double entry?</h2>
<div class="outline-text-2" id="text-4">
<p>
what is it, every transaction has a source and destination account.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">payee</td>
<td class="org-left">Amount</td>
</tr>

<tr>
<td class="org-left">paycheck</td>
<td class="org-left">+100 rs</td>
</tr>

<tr>
<td class="org-left">bouht stuff</td>
<td class="org-left">-20 rs</td>
</tr>

<tr>
<td class="org-left">Total</td>
<td class="org-left">80rs</td>
</tr>
</tbody>
</table>
</div>
<div id="outline-container-org74fb0fb" class="outline-3">
<h3 id="org74fb0fb"><span class="section-number-3">4.1.</span> Try this</h3>
<div class="outline-text-3" id="text-4-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">Assets: Checkin account 100rs</td>
</tr>

<tr>
<td class="org-left">Income:paycheck -100rs</td>
</tr>

<tr>
<td class="org-left">assets:checking account -20</td>
</tr>

<tr>
<td class="org-left">expenses:Stuff 20</td>
</tr>

<tr>
<td class="org-left">Total 0</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org326f763" class="outline-3">
<h3 id="org326f763"><span class="section-number-3">4.2.</span> The five accounts</h3>
<div class="outline-text-3" id="text-4-2">
<ul class="org-ul">
<li>Assets</li>
<li>expenses</li>
<li>Income</li>
<li>Liability</li>
<li>equity</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org0b7a5cc" class="outline-2">
<h2 id="org0b7a5cc"><span class="section-number-2">5.</span> Accounting equations</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-orgf67f85b" class="outline-3">
<h3 id="orgf67f85b"><span class="section-number-3">5.1.</span> Net worth = Assets - liabilities</h3>
</div>
<div id="outline-container-org341eb3b" class="outline-3">
<h3 id="org341eb3b"><span class="section-number-3">5.2.</span> Net income = Income - Expenses</h3>
</div>
</div>
<div id="outline-container-orgce9d41b" class="outline-2">
<h2 id="orgce9d41b"><span class="section-number-2">6.</span> so whats the point?</h2>
<div class="outline-text-2" id="text-6">
</div>
<div id="outline-container-orgd8acb5b" class="outline-3">
<h3 id="orgd8acb5b"><span class="section-number-3">6.1.</span> its your data</h3>
</div>
<div id="outline-container-orgf516a47" class="outline-3">
<h3 id="orgf516a47"><span class="section-number-3">6.2.</span> expressive reporting capacbility</h3>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Levin</p>
<p class="date">Created: 2024-08-08 Thu 00:10</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
